Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D13A.tmx
Source language: en_us
Languages: zh_cn

source: All you need to know about Ramadan
zh_cn: 伊斯兰教常识：斋月 (Ramadan)

source: What is Ramadan?
zh_cn: 什么是“斋月”？

source: The ninth month of the Islamic calendar, Ramadan, is one of the most important periods in the Muslim year.
zh_cn: 伊斯兰教历中的九月，是穆斯林一年中最重要的日子。

source: It is a time of spiritual awakening, self-evaluation and remembrance of Allah, which Muslims observe through fasting and prayer.
zh_cn: 期间，通过封斋和礼拜，穆斯林信众净化心灵，自我反省并缅怀先知(Allah)。

source: Ramadan teaches Muslims self-discipline, humility and giving.
zh_cn: 斋月让人们懂得自律，仁慈和施舍。

source: Charity is a significant part of Ramadan and Muslims are expected to help the needy.
zh_cn: 行善和帮助有需要的穆斯林是斋月的重要组成。

source: For more than a billion Muslims around the world, it is a time for devotion to God and self-restraint, when communal nightly prayers are conducted and the basic teachings of Islam are emphasised and Ummah (Islamic nation) consciousness is heightened.
zh_cn: 对全球十几亿穆斯林来说，斋月是表达对先知的赞美和加强自律的月份。夜晚一起进行的礼拜和对伊斯兰基本教义的宣讲，会加强伊斯兰各国间的团结。

source: When does Ramadan fall?
zh_cn: 斋月何时开始？

source: Ramadan falls 11 days earlier each year on the Gregorian calendar and the duration of the fast changes depending on which season the month falls in.
zh_cn: 伊斯兰教历的斋月（九月份）比阳历的九月早11天。而斋月的长短也视教历月份落在不同的季节而有所变化。

source: The start of Ramadan, as that of all Islamic months, is based on the sighting of the new moon, the hilal, which is why the crescent is often used as an unofficial symbol of the month.
zh_cn: 伊斯兰教历其他月份开始之日是根据新月初升的时间来判断。斋月的确切开始日期也是这样来确定的。

source: The moon sighting is also the reason that the start of Ramadan differs from one country to another, but many opt to follow Saudi Arabian sightings to be able to mark the days together.
zh_cn: 由于各国新月出现的时间有所不同，所以斋月开始的时间也不尽一致。但很多国家选择以沙特新月初现的时间为准。

source: As one of the five pillars of Islam, fasting during Ramadan, which is considered one of the highest forms of worship, is obligatory for those Muslims past the age of puberty who are mentally and physically fit and not travelling, as long as it does not cause them physical or mental harm.
zh_cn: 作为伊斯兰教五大天命之一，信徒在斋月里封斋被看做是最高形式的顶礼。所有成年穆斯林，只要精神和身体状况允许，且不在旅行途中，必须进行封斋。

source: Those who cannot fast during Ramadan, owing to health or other reasons, may fast in other months, or feed the poor.
zh_cn: 如果因健康或其他原因不能进行封斋的，可以到其他月份进行，或为穷人提供饮食来替代。

source: What exactly is required?
zh_cn: 如何封斋？

source: During a Ramadan fast, Muslims abstain from food, drink and sexual activity from dawn till dusk.
zh_cn: 斋月期间，每天从拂晓到黄昏，穆斯林信徒禁止饮食，饮水和房事。

source: A fast consists of a true and verbal intention that must be recited, as well as a package of dos and don'ts which are specifically emphasised during the month.
zh_cn: 封斋不但是一种内心和口头的意愿，更是由一系列哪些该做，哪些不该做的详细规定组成。

source: Fasting, or sawm (literally refrain), did not become obligatory until 624 AD. It is an opportunity to cleanse the body and mind and promote the principle of sincerity by keeping the individual away from arrogance.
zh_cn: 封斋，阿拉伯语称“Sawm”兴起于公元624年，是信徒净化身体和心灵，远离傲慢，坚定信仰的不可多得的机会。

source: Among the greatest benefits is the lesson in self-restraint and discipline that could be carried forward to other aspects of a person's life, such as work and education.
zh_cn: 通过斋月，信徒培养了自律和纪律。这些品质对他们人生许多方面有所裨益，如日常工作和教育。

source: A typical day of fasting begins with waking up before dawn to have a meal called the suhoor before the start of the fasting day.
zh_cn: 斋月中的一天是这度过的：信徒破晓前就起床，吃封斋饭（Suhoor)，然后开始一天的封斋。

source: At sunset, Muslims usually break their fast upon the call for Maghreb (sunset) prayers with another meal called iftar.
zh_cn: 在日落后，做晚上的祷告前，吃一点开斋小吃（Iftar)。

source: Prayers are conducted five times through the day, as they are on all days, and an extra set of prayers called Taraweeh is conducted after Isha or night prayers.
zh_cn: 一天做五次祷告。晚上还要进行一种特别的祷告Taraweeh。

source: Work hours in the private sector are shortened by two hours for Muslims and non-Muslims.
zh_cn: 在私人企业工作的穆斯林和非穆斯林工作时间缩短2小时。

source: Guide to Ramadan terms
zh_cn: 斋月常用语

source: Ramadan: The ninth month of the Islamic (lunar) calendar.
zh_cn: Ramadan:伊斯兰教历第九个月。

source: Sawm: The Arabic word for fast.
zh_cn: Sawm:阿拉伯语中的“封斋”

source: Iftar: Ending of the fast immediately after sunset.
zh_cn: Iftar:在日落时，结束一天的封斋。

source: Iftar takes place at the Maghrib Adhan (call to prayer) Traditionally the fast is ended with dates and water and is a time when friends and family come together.
zh_cn: 信众通常和家人一起，吃一点椰枣和水，称为开斋小吃。

source: Suhoor: The pre-fast meal before dawn and Fajr (morning call to prayer).
zh_cn: Suhoor:在破晓和晨拜前的用餐。

source: Taraweeh: Special congregational prayers conducted after Isha (night prayer)
zh_cn: Taraweeh：在宵拜后特别诵读的祝福祷文。

source: Qiyam-ul-Layl: Prayers during the last ten days of Ramadan
zh_cn: Qiyam-ul-Layl:指斋月结束前十天。

source: Eid Al Fitr: Three-day celebrations marking the end of Ramadan. It takes place on the 1st of Shawal, the 10th month of the Islamic calendar.
zh_cn: Eid Al Fitr:开斋节，是斋月的结束，也是伊斯兰教历10月份的开始，会有3天的庆祝活动。

source: Fidya: Compensation for missing a fast, for those unable to, or wrongly practising it.
zh_cn: Fidya:指那些无法进行封斋；错过了封斋；或没有进行进行正确封斋的人，进行的一种补偿形式。

source: Fidya usually takes the form of donating money, foodstuffs, or sacrificing an animal.
zh_cn: 通常是通过施舍金钱，食品或宰杀一头动物来进行。

source: Zakat Al Fitr: Muslims give away a certain percentage of the total value of all that they own annually and distribute it to charity and the needy. The contribution given at the end of Ramadan.
zh_cn: Zakat Al Fitr:穆斯林通常每年将自己财富的一定比例，捐献给慈善组织或有需要的人，通常在斋月结束时进行。
